base/Catalogs/бит_му_КлассыОсновныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_му_КлассыОсновныхСредств</Name>
			<Comment>(БИТ МУ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКласса</Name>
					<Comment>Вид класса</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыКлассовОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_му_ВидыКлассовОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыКлассовОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяСобственность</Name>
					<Comment>Инвестиционная собственность</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_му_КлассыОсновныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область НачальноеЗаполнениеДанных

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИнструментыИИнвентарь";
	Элемент.ВидКласса				  = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Элемент.Код 					  = "000000006";
	Элемент.Наименование 			  = НСтр("ru = 'Инструменты и инвентарь'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Земля";
	Элемент.ВидКласса 				  = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Элемент.Код 					  = "000000001";
	Элемент.Наименование 			  = НСтр("ru = 'Земля'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Здания";
	Элемент.ВидКласса 				  = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Элемент.Код 					  = "000000002";
	Элемент.Наименование			  = НСтр("ru = 'Здания'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ТранспортныеСредства";
	Элемент.ВидКласса 				  = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Элемент.Код						  = "000000005";
	Элемент.Наименование 			  = НСтр("ru = 'Транспортные средства'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Сооружения";
	Элемент.ВидКласса				  = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Элемент.Код 				 	  = "000000003";
	Элемент.Наименование 			  = НСтр("ru = 'Сооружения'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПрочиеОсновныеСредства";
	Элемент.ВидКласса 				  = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Элемент.Код						  = "000000009";
	Элемент.Наименование 			  = НСтр("ru = 'Прочие основные средства'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НезавершенноеСтроительство";
	Элемент.ВидКласса				  = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Элемент.Код 					  = "000000010";
	Элемент.Наименование			  = НСтр("ru = 'Незавершенное строительство'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МашиныИОборудование";
	Элемент.ВидКласса				  = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Элемент.Код 					  = "000000004";
	Элемент.Наименование			  = НСтр("ru = 'Машины и оборудование'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОфисноеОборудование";
	Элемент.ВидКласса				  = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Элемент.Код 					  = "000000008";
	Элемент.Наименование			  = НСтр("ru = 'Офисное оборудование'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗданияИС";
	Элемент.ВидКласса				  = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность;
	Элемент.Код 					  = "000000011";
	Элемент.Наименование 			  = НСтр("ru = 'Здания (ИС)'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗемляИС";
	Элемент.ВидКласса				  = Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность;
	Элемент.Код 					  = "000000012";
	Элемент.Наименование			  = НСтр("ru = 'Земля (ИС)'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Мебель";
	Элемент.ВидКласса 				  = Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства;
	Элемент.Код 					  = "000000007";
	Элемент.Наименование 			  = НСтр("ru = 'Мебель'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецПроцедуры

// См. бит_ОбновлениеИнформационнойБазыБФ.ПередОбновлениемИнформационнойБазы().
//
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
